wolaite2024/jlab-jh5003-earphone/inc/rtl87x3d/io/rtl876x_sdio.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rtl876x_sdio.h
* @brief     The header file of SDIO driver.
* @details
* @author   elliot chen
* @date     2024-07-18
* @version   v1.0
* *********************************************************************************************************
*/

#ifndef _RTL876x_SDIO_H_
#define _RTL876x_SDIO_H_

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdbool.h>
#include "rtl876x.h"

/* Peripheral: SDIO */
/* Description: SDIO register defines */
#define SDIO_SYS_REG                    0x4005D000
/* Register: TF_MODE --------------------------------------------------*/
/* Description: Transfer mode Register. Offset: 0x0C. Address: 0x4005C00CUL. */
/* TF_MODE[5] :SDIO_MULTI_BLOCK. */
#define SDIO_MULTI_BLOCK_EN                 BIT(5)
#define SDIO_AUTO_CMD12_EN                  BIT(2)
#define SDIO_BLOCK_COUNT_EN                 BIT(1)

/* Register: PRESENT_STATE --------------------------------------------------*/
/* Description: Present State Register. Offset: 0x24. Address: 0x4005C024UL. */
/* PRESENT_STATE[1] :SDIO_DAT_INHIBIT. */
#define SDIO_DAT_INHIBIT                    BIT(1)
/* PRESENT_STATE[0] :SDIO_CMD_INHIBIT. */
#define SDIO_CMD_INHIBIT                    BIT(0)

/* Register: PWR_CTRL ------------------------------------------------------*/
/* Description: Power control register. Offset: 0x29. Address: 0x4005C029UL. */
/* PWR_CTRL[3:1] :SDIO_BUS_VOLTAGE. */
#define SDIO_BUS_VOLTAGE_POS                (1UL)
#define SDIO_BUS_VOLTAGE_MASK               (0x1UL << SDIO_BUS_VOLTAGE_POS)
#define SDIO_BUS_VOLTAGE_CLR                (~SDIO_BUS_VOLTAGE_MASK)
#define SDIO_VOLT_3_3V                      ((uint32_t)7 << SDIO_BUS_VOLTAGE_POS)
#define SDIO_VOLT_3_0V                      ((uint32_t)6 << SDIO_BUS_VOLTAGE_POS)
#define SDIO_VOLT_1_8V                      ((uint32_t)5 << SDIO_BUS_VOLTAGE_POS)
/* PWR_CTRL[0] :SDIO_BUS_PWR. 0x1: Power on. 0x0: Power down. */
#define SDIO_BUS_PWR_POS                    (0UL)
#define SDIO_BUS_PWR_MASK                   (0x1UL << SDIO_BUS_PWR_POS)
#define SDIO_BUS_PWR_CLR                    (~SDIO_BUS_PWR_MASK)

/* Register: CLK_CTRL -------------------------------------------------------*/
/* Description: clock control register. Offset: 0x2C. Address: 0x4005C02CUL. */
/* CLK_CTRL[1] :SDIO_INTERNAL_CLOCK_STABLE. 0x1: Enable. 0x0: Disable. */
#define SDIO_INTERNAL_CLK_STABLE_POS        (1UL)
#define SDIO_INTERNAL_CLK_STABLE_MASK       (0x1UL << SDIO_INTERNAL_CLK_STABLE_POS)
#define SDIO_INTERNAL_CLK_STABLE_CLR        (~SDIO_INTERNAL_CLK_STABLE_MASK)
/* CLK_CTRL[0] :SDIO_INTERNAL_CLOCK. 0x1: Enable. 0x0: Disable. */
#define SDIO_INTERNAL_CLOCK_POS             (0UL)
#define SDIO_INTERNAL_CLOCK_MASK            (0x1UL << SDIO_INTERNAL_CLOCK_POS)
#define SDIO_INTERNAL_CLOCK_CLR             (~SDIO_INTERNAL_CLOCK_MASK)

/* Register: SW_RESET -------------------------------------------------------*/
/* Description: Software reset register. Offset: 0x2F. Address: 0x4005C02FUL. */
/* SW_RESET[0] :SDIO_SF_RESET. 0x1: Reset. 0x0: Work. */
#define SDIO_SF_RESET_POS                   (0UL)
#define SDIO_SF_RESET_MASK                  (0x1UL << SDIO_SF_RESET_POS)
#define SDIO_SF_RESET_CLR                   (~SDIO_SF_RESET_MASK)

/* Register: CAPABILITIES_L ---------------------------------------------------*/
/* Description: Capabilities Register. Offset: 0x40. Address: 0x4005C040UL. */
#define SDIO_CAPA_TIMEOUT_CLK_UNIT          BIT(7)
#define SDIO_CAPA_ADMA2_SUPPORT             BIT(19)
#define SDIO_CAPA_HIGH_SPEED_SUPPORT        BIT(21)
#define SDIO_CAPA_VOLT_SUPPORT_33V          BIT(24)
#define SDIO_CAPA_VOLT_SUPPORT_30V          BIT(25)
#define SDIO_CAPA_VOLT_SUPPORT_18V          BIT(26)


/** @addtogroup 87x3d_SDIO SDIO
  * @brief SDIO driver module.
  * @{
  */

/*============================================================================*
 *                         Types
 *============================================================================*/

/** @defgroup SDIO_Exported_Types SDIO Exported Types
  * @{
  */

/**
 * @brief SDIO initialize parameters.
 *
 *
 */
typedef struct
{
    uint32_t SDIO_ClockDiv;         /*!< Specifies the clock frequency of the SDIO controller.
                                    This parameter can be a value of @ref SDIO_ClockDiv. */

    uint32_t SDIO_TimeOut;          /*!< Specifies whether the SDIO time out.
                                    This parameter must range from 0 to 14. */

    uint32_t SDIO_BusWide;          /*!< Specifies the SDIO bus width. */

} SDIO_InitTypeDef;

/**
 * @brief SDIO command initialize parameters.
 *
 *
 */
typedef struct
{
    uint32_t SDIO_Argument;         /*!< Specifies the command argument. */

    uint32_t SDIO_CmdIndex;         /*!< Specifies the command number.
                                    This parameter can be a value of 0 to 63. */

    uint32_t SDIO_CmdType;          /*!< Specifies the command type.
                                    This parameter can be a value of @ref SDIO_CMD_TYPE. */

    uint32_t SDIO_DataPresent;      /*!< Specifies whether to present data using DAT line.
                                    This parameter can be a value of @ref DATA_PRESENT_SEL. */

    uint32_t SDIO_CmdIdxCheck;      /*!< Specifies whether the host controller shall check index field.
                                    This parameter can be a value of ENABLE or DISABLE. */

    uint32_t SDIO_CmdCrcCheck;      /*!< Specifies whether the host controller shall check crc field.
                                    This parameter can be a value of ENABLE or DISABLE. */

    uint32_t SDIO_ResponseType;     /*!< Specifies response type.
                                    This parameter can be a value of @ref SDIO_RSP_TYPE. */

} SDIO_CmdInitTypeDef;

/**
 * @brief SDIO data transmission initialize parameters.
 *
 *
 */
typedef struct
{
    uint32_t SDIO_Address;      /*!< Specifies the start address of the Descriptor table.
                                    This parameter can be a value 4 aligned address. */

