wolaite2024/jlab-jh5003-earphone/inc/rtl87x3d/io/rtl876x_sdio.h
    uint32_t SDIO_BlockSize;    /*!< Specifies the block size of data trnasfers for CMD17,
                                    CMD18, CMD24, CMD25 and CMD53, in the case of high capacity
                                    memory card, the size of data block is fixed to 512 bytes.
                                    This parameter can be a value of 0 to 0x800. */

    uint32_t SDIO_BlockCount;   /*!< Specifies the block count for current transfer.
                                    This parameter can be a value of 0 to 0xffff. */

    uint32_t SDIO_TransferDir;  /*!< Specifies the data transfer direction of DAT line data transfers.
                                    This parameter can be a value of @ref IS_SDIO_TRANSFER_DIR. */

    uint32_t SDIO_TransferMode; /*!< Specifies the transfer mode. */

    uint32_t SDIO_DMAEn;        /*!< Specifies whether to enable DMA functionlity.
                                    This parameter can be a value of ENABLE or DISABLE. */

} SDIO_DataInitTypeDef;

/**
 * @brief ADMA2 descriptor attribute initialize parameters.
 *
 *
 */
typedef struct
{
    uint16_t SDIO_Valid: 1;
    uint16_t SDIO_End: 1;
    uint16_t SDIO_Int: 1;
    uint16_t SDIO_Rsvd1: 1;
    uint16_t SDIO_Act1: 1;
    uint16_t SDIO_Act2: 1;
    uint16_t SDIO_Rsvd2: 10;
} ADMA2_AttrTypedef;

/**
 * @brief ADMA2 descriptor table initialize parameters.
 *
 *
 */
typedef struct
{
    ADMA2_AttrTypedef SDIO_Attribute;
    uint16_t SDIO_Length;
    uint32_t SDIO_Address;
} SDIO_ADMA2TypeDef;

/** End of group SDIO_Exported_Types
  * @}
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/

/** @defgroup SDIO_Exported_Constants SDIO Exported Constants
  * @{
  */

#define IS_SDIO_PERIPH(PERIPH) ((PERIPH) == SDIO)

/** @defgroup SDIO_Pin_Group SDIO Pin Group
  * @{
  */

#define SDIO_PinGroup_0                     ((uint32_t)0x00000000)
#define SDIO_PinGroup_1                     ((uint32_t)0x00000001)

#define IS_SDIO_PINGROUP_IDX(IDX) (((IDX) == SDIO_PinGroup_0) || ((IDX) == SDIO_PinGroup_1))

/** End of group SDIO_Pin_Group
  * @}
  */

/** @defgroup SDIO_Power_State SDIO Power State
  * @{
  */

#define SDIO_PowerState_OFF                 ((uint32_t)0x00000000)
#define SDIO_PowerState_ON                  ((uint32_t)0x00000001)

#define IS_SDIO_POWER_STATE(STATE) (((STATE) == SDIO_PowerState_OFF) || ((STATE) == SDIO_PowerState_ON))

/** End of group SDIO_Power_State
  * @}
  */

/** @defgroup SDIO_ClockDiv SDIO Clock Div
  * @{
  */

#define SDIO_CLOCK_DIV_1                    ((uint32_t)((0x0) << 8))
#define SDIO_CLOCK_DIV_2                    ((uint32_t)((0x1) << 8))
#define SDIO_CLOCK_DIV_4                    ((uint32_t)((0x2) << 8))
#define SDIO_CLOCK_DIV_8                    ((uint32_t)((0x4) << 8))
#define SDIO_CLOCK_DIV_16                   ((uint32_t)((0x8) << 8))
#define SDIO_CLOCK_DIV_32                   ((uint32_t)((0x10) << 8))
#define SDIO_CLOCK_DIV_64                   ((uint32_t)((0x20) << 8))
#define SDIO_CLOCK_DIV_128                  ((uint32_t)((0x40) << 8))
#define SDIO_CLOCK_DIV_256                  ((uint32_t)((0x80) << 8))

#define IS_SDIO_CLOCK_DIV(CTRL)         (((CTRL) == SDIO_CLOCK_DIV_1) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_2) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_4) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_8) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_16) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_32) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_64) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_128) || \
                                         ((CTRL) == SDIO_CLOCK_DIV_256))

/** End of group SDIO_ClockDiv
  * @}
  */

/** @defgroup SDIO_BusWide SDIO Bus Wide
  * @{
  */

#define SDIO_BusWide_1b                     ((uint32_t)0x00)
#define SDIO_BusWide_4b                     ((uint32_t)0x02)

#define IS_SDIO_BUS_WIDE(WIDE) (((WIDE) == SDIO_BusWide_1b) || ((WIDE) == SDIO_BusWide_4b))

/** End of group SDIO_BusWide
  * @}
  */

/** @defgroup SDIO_TimeOut SDIO Timeout
  * @{
  */

#define IS_SDIO_TIME_OUT(TIME) ((TIME) <= 0x0E)

/** End of group SDIO_TimeOut
  * @}
  */

/** @defgroup SDIO_Block_Size SDIO Block Size
  * @{
  */

#define IS_SDIO_BLOCK_SIZE(SIZE)            ((SIZE) <= 0x800)

/** End of group SDIO_Block_Size
  * @}
  */

/** @defgroup SDIO_Block_COUNT SDIO Block Count
  * @{
  */

#define IS_SDIO_BLOCK_COUNT(COUNT)          ((COUNT) <= 0xFFFF)

/** End of group SDIO_Block_COUNT
  * @}
  */

/** @defgroup SDIO_Transfer_Direction SDIO Transfer Direction
  * @{
  */

#define SDIO_TransferDir_READ               ((uint32_t)1 << 4)
#define SDIO_TransferDir_WRITE              ((uint32_t)0x00)
#define IS_SDIO_TRANSFER_DIR(DIR) (((DIR) == SDIO_TransferDir_READ) || \
                                   ((DIR) == SDIO_TransferDir_WRITE))
/** End of group SDIO_Transfer_Direction
  * @}
  */

/** @defgroup SDIO_Command_Index SDIO Command Index
  * @{
  */

#define IS_SDIO_CMD_INDEX(INDEX)            ((INDEX) < 0x40)

/** End of group SDIO_Command_Index
  * @}
  */

/** @defgroup SDIO_CMD_TYPE SDIO CMD Type
  * @{
  */

typedef enum
{
    NORMAL,
    SUSPEND,
    RESUME,
    ABORT
} SDIO_CMD_TYPE;

/** End of group SDIO_CMD_TYPE
  * @}
  */

/** @defgroup SDIO_DATA_PRESENT_SEL SDIO Data Present Select
  * @{
  */

typedef enum
{
    NO_DATA,
    WITH_DATA
} DATA_PRESENT_SEL;

/** End of group SDIO_DATA_PRESENT_SEL
  * @}
  */

/** @defgroup SDIO_RSP_TYPE SDIO Response Type
  * @{
  */

typedef enum
{
    SDIO_Response_No,
    RSP_LEN_136,
    RSP_LEN_48,
    RSP_LEN_48_CHK_BUSY
} SDIO_RSP_TYPE;

/** End of group SDIO_RSP_TYPE
  * @}
  */

/** @defgroup SDIO_Interrupts_Definition SDIO Interrupt Definition
  * @{
  */
#define SDIO_INT_ERROR                      ((uint32_t)1 << 15)
#define SDIO_INT_CARD                       ((uint32_t)1 << 8)
#define SDIO_CARD_REMOVAL                   ((uint32_t)1 << 7)
#define SDIO_CARD_INSERT                    ((uint32_t)1 << 6)
#define SDIO_BUF_READ_RDY                   ((uint32_t)1 << 5)
#define SDIO_BUF_WRITE_RDY                  ((uint32_t)1 << 4)
#define SDIO_INT_DMA                        ((uint32_t)1 << 3)
#define SDIO_BLOCK_GAP_EVENT                ((uint32_t)1 << 2)
#define SDIO_INT_TF_CMPL                    ((uint32_t)1 << 1)
#define SDIO_INT_CMD_CMPL                   ((uint32_t)1 << 0)

#define IS_SDIO_INT(INT) (((INT)  == SDIO_INT_ERROR)        || \
                          ((INT)  == SDIO_INT_CARD)       || \
                          ((INT)  == SDIO_INT_DMA)        || \
                          ((INT)  == SDIO_INT_TF_CMPL)    || \
                          ((INT)  == SDIO_INT_CMD_CMPL))

/** End of group SDIO_Interrupts_Definition
  * @}
  */

