wolaite2024/jlab-jh5003-earphone/inc/rtl87x3d/io/rtl876x_sdio.h
/**
 * rtl876x_sdio.h
 *
 * \brief  Enable or disable the specified SDIO error interrupts.
 *
 * \param[in] SDIO_INT: specifies the SDIO error interrupts sources to be enabled or disabled.
 *            This parameter can be one of the following values:
 *            \arg SDIO_INT_VENDOR_SPECIFIC_ERR: Additional status bits can be defined in this register by the vendor.
 *            \arg SDIO_INT_ADMA_ERR: Set when the host controller detects errors during ADMA based data transfer.
 *            \arg SDIO_INT_AUTO_CMD12_ERR: Set when detecting that one of this bits D00-D04 in Auto CMD12
 *                 Error Status register has changed from 0 to 1.
 *            \arg SDIO_INT_CURRENT_LIMIT_ERR: Current limit error, by setting the SD Bus Power bit in the Power Control register,
 *                 the Host Controller is requested to supply power for the SD Bus.
 *            \arg SDIO_INT_DAT_END_BIT_ERR: Set when detecting 0 at the end bit position of read data
 *                 which uses the DAT line or at the end bit position of the CRC Status.
 *            \arg SDIO_INT_DAT_CRC_ERR: Set when detecting a CRC error in data transfer through the DAT line.
 *            \arg SDIO_INT_DAT_TIMEOUT_ERR: Set when detecting one of following timeout conditions:
 *                 Busy timeout for R1b,R5b type; Busy timeout after Write CRC status;
 *                 Write CRC Status timeout; Read Data timeout.
 *            \arg SDIO_INT_CMD_INDEX_ERR: Set if the command index error occurs in response to a command.
 *            \arg SDIO_INT_CMD_END_BIT_ERR: Set when detecting that the end bit of command response is 0.
 *            \arg SDIO_INT_CMD_CRC_ERR: Set when detecting a CRC error in the command response.
 *            \arg SDIO_INT_CMD_TIMEOUT_ERR: Set if no response is returned within 64 SDCLK cycles from
 *                 the end bit of command.
 * \param[in] NewState: New state of the specified SDIO error interrupts.
 *            This parameter can be one of the following values:
 *            \arg ENABLE: Enable the specified SDIO error interrupts.
 *            \arg DISABLE: Disable the specified SDIO error interrupts.
 *
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_error_config(void)
 * {
 *     SDIO_ErrrorINTConfig(SDIO_INT_CMD_CRC_ERR, ENABLE);
 * }
 * \endcode
 */
void SDIO_ErrrorINTConfig(uint32_t SDIO_INT, FunctionalState newState);

/**
 * rtl876x_sdio.h
 *
 * \brief  Enable or disable the specified SDIO wake up event.
 *
 * \param[in] SDIO_WakeUp: Specifies the SDIO wake up sources to be enabled or disabled.
 *            This parameter can be one of the following values:
 *            \arg SDIO_WAKE_UP_SDCARD_REMOVAL: Wakeup Event Enable On SD Card Removal. This bit enables
 *                 wakeup event via Card Removal assertion in the Normal Interrupt Status register.
 *            \arg SDIO_WAKE_UP_SDCARD_INSERT: Wakeup Event Enable On SD Card Insertion. This bit enables
 *                 wakeup event via Card Insertion assertion in the Normal Interrupt Status register.
 *            \arg SDIO_WAKE_UP_SDCARD_INTR: Wakeup Event Enable On Card Interruptis bit enables
 *                 wakeup event via Card Interrupt assertion in the Normal Interrupt Status register.
 * \param[in] NewState: New state of the SDIO wake up event.
 *            This parameter can be one of the following values:
 *            \arg ENABLE: Enable the specified SDIO wake up event.
 *            \arg DISABLE: Disable the specified SDIO wake up event.
 *
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_wakeup_config(void)
 * {
 *     SDIO_WakeUpConfig(SDIO_WAKE_UP_SDCARD_REMOVAL, ENABLE);
 * }
 * \endcode
 */
void SDIO_WakeUpConfig(uint32_t SDIO_WakeUp, FunctionalState newState);

/**
 * rtl876x_sdio.h
 *
 * \brief  Check whether the specified SDIO interrupt is set.
 *
 * \param[in] SDIO_INT: specifies the interrupt to check.
 *            This parameter can be one of the following values:
 *            \arg SDIO_INT_ERROR: Error interrupt signal caused by any type error in error interrupt status register.
 *            \arg SDIO_INT_CARD: Card interrupt status.
 *            \arg SDIO_INT_DMA: DMA interrupt status. In case of ADMA, by setting int field
 *                 in the descriptor table, host controller generates this interrupt.
 *            \arg SDIO_INT_TF_CMPL: Transfer complete interrupt status. Set when a read/write transfer
 *                 and a command with busy is complete.
 *            \arg SDIO_INT_CMD_CMPL: Command complete interrupt status. Set when get the end bit
 *                 of command response(Except Auto CMD12).
 *            \arg SDIO_BLOCK_GAP_EVENT: Set when stop at Block Gap Request.
 *
 * \return The new state of ITStatus.
 * \retval SET: The specified SDIO interrupt is set.
 * \retval RESET: The specified SDIO interrupt is unset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_handler(void)
 * {
 *     if (SDIO_GetINTStatus(SDIO_INT_CMD_CMPL) == SET)
 *     {
 *         //add user code here.
 *     }
 * }
 * \endcode
 */
ITStatus SDIO_GetINTStatus(uint32_t SDIO_INT);

/**
 * rtl876x_sdio.h
 *
 * \brief  Check whether the specified SDIO error interrupt is set.
 *
 * \param[in] SDIO_INT: Specifies the error interrupt to check.
 *            This parameter can be one of the following values:
 *            \arg SDIO_INT_VENDOR_SPECIFIC_ERR: Additional status bits can be defined in this register by the vendor.
 *            \arg SDIO_INT_ADMA_ERR: Set when the host controller detects errors during ADMA based data transfer.
 *            \arg SDIO_INT_AUTO_CMD12_ERR: Set when detecting that one of this bits D00-D04 in Auto CMD12
 *                 Error Status register has changed from 0 to 1.
 *            \arg SDIO_INT_CURRENT_LIMIT_ERR: Current limit error, by setting the SD Bus Power bit in the Power Control register,
 *                 the Host Controller is requested to supply power for the SD Bus.
 *            \arg SDIO_INT_DAT_END_BIT_ERR: Set when detecting 0 at the end bit position of read data
 *                 which uses the DAT line or at the end bit position of the CRC Status.
 *            \arg SDIO_INT_DAT_CRC_ERR: Set when detecting a CRC error in data transfer through the DAT line.
 *            \arg SDIO_INT_DAT_TIMEOUT_ERR: Set when detecting one of following timeout conditions:
 *                 Busy timeout for R1b,R5b type; Busy timeout after Write CRC status;
 *                 Write CRC Status timeout; Read Data timeout.
 *            \arg SDIO_INT_CMD_INDEX_ERR: Set if the command index error occurs in response to a command.
 *            \arg SDIO_INT_CMD_END_BIT_ERR: Set when detecting that the end bit of command response is 0.
 *            \arg SDIO_INT_CMD_CRC_ERR: Set when detecting a CRC error in the command response.
 *            \arg SDIO_INT_CMD_TIMEOUT_ERR: Set if no response is returned within 64 SDCLK cycles from
 *                 the end bit of command.
 *
 * \return The new state of ITStatus.
 * \retval SET: The specified SDIO error interrupt is set.
 * \retval RESET: The specified SDIO error interrupt is unset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_handler(void)
 * {
 *     if (SDIO_GetErrorINTStatus(SDIO_INT_CMD_TIMEOUT_ERR) == SET)
 *     {
 *         //add user code here.
 *     }
 * }
 * \endcode
 */
ITStatus SDIO_GetErrorINTStatus(uint32_t SDIO_INT);

/**
 * rtl876x_sdio.h
 *
 * \brief  Clear the specified SDIO interrupt pending bits.
 *
 * \param[in] SDIO_INT: Specifies the interrupt pending bit to clear.
 *            This parameter can be one of the following values:
 *            \arg SDIO_INT_ERROR: Error interrupt signal caused by any type error in error interrupt status register.
 *            \arg SDIO_INT_CARD: Card interrupt status.
 *            \arg SDIO_INT_DMA: DMA interrupt status. In case of ADMA, by setting int field
 *                 in the descriptor table, host controller generates this interrupt.
 *            \arg SDIO_INT_TF_CMPL: Transfer complete interrupt status. Set when a read/write transfer
 *                 and a command with busy is complete.
 *            \arg SDIO_INT_CMD_CMPL: Command complete interrupt status. Set when get the end bit
 *                 of command response(Except Auto CMD12).
 *            \arg SDIO_BLOCK_GAP_EVENT: Set when stop at Block Gap Request.
 *
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_handler(void)
 * {
 *     if (SDIO_GetINTStatus(SDIO_INT_CMD_CMPL) == SET)
 *     {
 *         SDIO_ClearINTPendingBit(SDIO_INT_CMD_CMPL);
 *     }
 * }
 * \endcode
 */
void SDIO_ClearINTPendingBit(uint32_t SDIO_INT);

/**
 * rtl876x_sdio.h
 *
 * \brief  Clear the specified SDIO error interrupt pending bits.
 *
 * \param[in] SDIO_INT: Specifies the SDIO error interrupt pending bit to clear.
 *            This parameter can be one of the following values:
 *            \arg SDIO_INT_VENDOR_SPECIFIC_ERR: Additional status bits can be defined in this register by the vendor.
 *            \arg SDIO_INT_ADMA_ERR: Set when the host controller detects errors during ADMA based data transfer.
 *            \arg SDIO_INT_AUTO_CMD12_ERR: Set when detecting that one of this bits D00-D04 in Auto CMD12
 *                 Error Status register has changed from 0 to 1.
 *            \arg SDIO_INT_CURRENT_LIMIT_ERR: Current limit error, by setting the SD Bus Power bit in the Power Control register,
 *                 the Host Controller is requested to supply power for the SD Bus.
 *            \arg SDIO_INT_DAT_END_BIT_ERR: Set when detecting 0 at the end bit position of read data
 *                 which uses the DAT line or at the end bit position of the CRC Status.
 *            \arg SDIO_INT_DAT_CRC_ERR: Set when detecting a CRC error in data transfer through the DAT line.
 *            \arg SDIO_INT_DAT_TIMEOUT_ERR: Set when detecting one of following timeout conditions:
 *                 Busy timeout for R1b,R5b type; Busy timeout after Write CRC status;
 *                 Write CRC Status timeout; Read Data timeout.
 *            \arg SDIO_INT_CMD_INDEX_ERR: Set if the command index error occurs in response to a command.
 *            \arg SDIO_INT_CMD_END_BIT_ERR: Set when detecting that the end bit of command response is 0.
 *            \arg SDIO_INT_CMD_CRC_ERR: Set when detecting a CRC error in the command response.
 *            \arg SDIO_INT_CMD_TIMEOUT_ERR: Set if no response is returned within 64 SDCLK cycles from
 *                 the end bit of command.
 *
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_handler(void)
 * {
 *     if (SDIO_GetErrorINTStatus(SDIO_INT_CMD_TIMEOUT_ERR) == SET)
 *     {
 *         SDIO_ClearErrorINTPendingBit(SDIO_INT_CMD_TIMEOUT_ERR);
 *     }
 * }
 * \endcode
 */
void SDIO_ClearErrorINTPendingBit(uint32_t SDIO_INT);

/**
 * rtl876x_sdio.h
 *
 * \brief  Return response received from the card for the last command.
 *
 * \param[in] SDIO_RSP: Specifies the SDIO response register.
 *            This parameter can be one of the following values:
 *            \arg SDIO_RSP0: Response Register 0~1.
 *            \arg SDIO_RSP2: Response Register 2~3.
 *            \arg SDIO_RSP4: Response Register 4~5.
 *            \arg SDIO_RSP6: Response Register 6~7.
 *
 * \return value of SDIO_RESP.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_init(void)
 * {
 *     uint32_t response = SDIO_GetResponse(SDIO_RSP0);
 * }
 * \endcode
 */
uint32_t SDIO_GetResponse(uint32_t SDIO_RSP);


/**
 * rtl876x_sdio.h
 *
 * \brief  Select the SDIO data bus pin.
 *
 * \param[in] SDIO_BusWide: Value of SDIO bus wide.
 *            This parameter can be one of the following values:
 *            \arg SDIO_BusWide_1b: 1-bit mode.
 *            \arg SDIO_BusWide_4b: 4-bit mode.
 * \param[in] NewState: New state of the SDIO data pin.
 *            This parameter can be one of the following values:
 *            \arg ENABLE: Enable the SDIO data bus pin.
 *            \arg DISABLE: Disable the SDIO data bus pin.
 *
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_init(void)
 * {
 *     SDIO_DataPinConfig(SDIO_BusWide_1b, ENABLE);
 * }
 * \endcode
 */
void SDIO_DataPinConfig(uint32_t SDIO_BusWide, FunctionalState NewState);


/**
 * rtl876x_sdio.h
 *
 * \brief  Set the flag for SDIO operating.
 *
 * \param[in] sdio_mode: Specifies the Current SDIO mode.
 *            This parameter can be one of the following values:
 *            \arg SDIO_FLAG_IDLE: Set the Current SDIO mode to idle.
 *            \arg SDIO_FLAG_READ: Set the Current SDIO mode to read.
 *            \arg SDIO_FLAG_WRITE: Set the Current SDIO mode to write.
 *
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_init(void)
 * {
 *     sdio_set_flag(SDIO_FLAG_READ);
 * }
 * \endcode
 */
extern void sdio_set_flag(uint32_t sdio_mode);


/**
 * rtl876x_sdio.h
 *
 * \brief  Get the SDIO busy flag.
 *
 * \param  None.
 *
 * \return Indicate if SDIO is busy.
 * \retval true   The SDIO is busy.
 * \retval false  The SDIO is not busy.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void sdio_demo(void)
 * {
 *     sdio_get_busy_flag();
 * }
 * \endcode
 */
extern bool sdio_get_busy_flag(void);

/**
 * rtl876x_sdio.h
 *
 * \brief  Select bus delay through the SDIO peripheral.
 *
 * \xrefitem Experimental_Added_API_2_14_0_0 "Experimental Added Since 2.14.0.0" "Experimental Added API
 *
 * \param[in] SDIO_BusWide: Value of SDIO bus wide.
 *            This parameter can be one of the following values:
 *            \arg SDIO_BusWide_1b: 1-bit mode.
 *            \arg SDIO_BusWide_4b: 4-bit mode.
 * \param[in] SDIO_BusDelay: bus delay time(unit ns), range from 0 to 15.
 *
 * \return None.
 */
void SDIO_BusDelaySel(uint32_t SDIO_BusWide, uint8_t SDIO_BusDelay);

#ifdef __cplusplus
}
#endif

#endif /* _RTL876x_SDIO_H_ */

/** @} */ /* End of group SDIO_Exported_Functions */
/** @} */ /* End of group 87x3d_SDIO */

/******************* (C) COPYRIGHT 2024 Realtek Semiconductor Corporation *****END OF FILE****/

